app/controllers/babies_controller.rb

  def index
    @babies = Baby.all
---
SELECT "babies".* FROM "babies"

  def create
    @baby = current_user.build_baby(baby_params)

    if @baby.save
---
INSERT INTO "babies" ("age", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["age", 16], ["created_at", 2017-05-06 23:29:40 UTC], ["updated_at", 2017-05-06 23:29:40 UTC], ["user_id", 9]]

  def destroy
    @baby.destroy
---
DELETE FROM "babies" WHERE "babies"."id" = $1  [["id", 18]]

    def set_baby
      validate_user
      @baby = current_user.babies.find(params[:id])
---
SELECT  "babies".* FROM "babies" WHERE "babies"."user_id" = $1 LIMIT $2  [["user_id", 16], ["LIMIT", 1]]