app/controllers/mothers_controller.rb

  def index
    @mothers = Mother.all
---
SELECT "mothers".* FROM "mothers"

  def set_mother
    validate_user
    @mother = current_user.mothers.find(params[:id])
---
SELECT  "mothers".* FROM "mothers" WHERE "mothers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]